[
    {
        "_id": "62b0c5c7b2d4cef92e048c5a",
        "category": "MERN Stack",
        "features": "Users can sign up or log in using email, password, or social logins like Google. This feature is implemented using Firebase authentication BR Users can place an order for tools and are also able to cancel the order before payment. Users can see their placed orders on the 'dashboard/order' page with order status, but only when the user is logged in as routes are protected. BR Users can pay for the services. The payment system is integrated using Stripe. BR A control panel is implemented for Admin, but only when the Admin is logged in as routes are protected only for Admin. BR Admin can control orders, users, and products. Admin can cancel unpaid orders. BR Admin can change the order status from pending to shipped for paid orders. Users can see the order status 'shipped' on their order page. BR Admin can add a product with an image, update product details including stock updates, and all other information. BR User and appointment data is stored in MongoDB. APIs are built with Node.js and Express.js. BR Admin and user-specific APIs are protected using Jsonwebtoken. BR This single-page web app is completely made with React and its router feature. It's also fully responsive for mobile and tablet devices.",
        "img": "https://i.ibb.co/PGmWBfS/Screenshot-68.png",
        "linkClient": "https://github.com/rkreaz/technocy-resources-client",
        "linkServer": "https://github.com/rkreaz/technocy-resources-server",
        "live": " https://technocy-resources-client.web.app/",
        "technologies": "ReactJS, React router, Tailwindcss, Daisyui, React-rating, React-stripe-js, Tanstack-query, Aos, Axios, React-captcha, React-countdown, React-marquee, React-helmet, React-Hook-Form, Firebase, React-icons, Recharts, Sweetalert2, Swiper, Nodejs, Express.js, MongoDB, Jsonwebtoken, React-firebase-hooks, Stripe.",
        "title": "Manufacturer E-Commerce Management"
    },
    {
        "_id": "62b0c5c7b2d4cef92e048c5b",
        "category": "MERN Stack",
        "features": "Users can signup or log in using email, password, or using social logins like Google, This feature is implemented using firebase authentication. BR Users are able to add/delete/stock-change of products, and users are also able to see their own added products on my item page, But only when the user is logged in as routes are protected. BR UUser/Product data is stored in MongoDB. APIs are built with NodeS and ExpressJS. User-specific APIs are protected using Jsonwebtoken. BR Admin able to add a product with image, update and all the other info. BR Admin also makes a user Admin, Admin specific API are protected using Jsonwebtoken and Admin role. BR This single-page web app is completely made with …o fully responsive for mobile and tablet devices.",
        "img": "https://i.ibb.co/qswM3QZ/Screenshot-72.png",
        "linkClient": "https://github.com/rkreaz/bistro-boss-restaurant-client",
        "linkServer": "https://github.com/rkreaz/bistro-boss-restaurant-server",
        "live": "https://bistro-boss-restaurant-c-efd39.web.app/",
        "technologies": "ReactJS, React router, Tailwindcss, Daisyui, React-rating, React-stripe-js, Tanstack-query, Aos, Axios, React-captcha, React-countdown, React-marquee, React-helmet, React-Hook-Form, Firebase, React-icons, Recharts, Sweetalert2, Swiper, Nodejs, Express.js, MongoDB, Jsonwebtoken, React-firebase-hooks, Stripe.",
        "title": "Restaurant serving delicious food"
    }
]